{
  "recommended": [{
  "id": "0",
  "title": "Alice In Borderland",
  "type": "Tv series",
  "year": 2022,
  "mark": "PG",
  "url": "images/Alice.jpg",
  "isBookmarked": true,
  "desc": "Alice in Borderland (Japanese: 今際の国のアリス, Hepburn: Imawa no Kuni no Arisu) is a 2020 Japanese science fiction thriller drama streaming television series based on the manga of the same name by Haro Aso. Directed by Shinsuke Sato, the series stars Kento Yamazaki and Tao Tsuchiya as allies trapped in an abandoned Tokyo where they are forced to compete in dangerous games, the type and difficulty of which are determined by playing cards. After surviving their first game, players receive visas, which are extended the more they compete; if the visas expire, the individuals are executed by red lasers being shot from the sky."
},{
  "id": "1",
  "title": "All Of Us Are Dead",
  "type": "Tv series",
  "year": 2022,
  "mark": "E",
  "url": "images/Allofusaredead.jpg",
  "isBookmarked": true,
  "desc": "All of Us Are Dead is a clever and effective zombie survival story. Set in a high school in South Korea, it follows a group of students who become trapped after the outbreak of a zombie virus. These students use everything at hand to protect themselves and survive.Some of the characters include Nam On-jo (Park Ji-hu), whose dad is a firefighter and taught her useful survival skills; Lee Cheong-san (Yoon Chan-young), On-jo's childhood friend who has a thing for her; and Choi Nam-ra (Cho Yi-yun), the class president."
},{
  "id": "2",
  "title": "Along With The gods",
  "type": "Tv series",
  "year": 2022,
  "mark": "E",
  "url": "images/Alongwithgods.jpg",
  "isBookmarked": true,
  "desc": "When the fireman Kim Ja-hong dies during a rescue operation in a fire in a building, his guardians Kangrim, Haewonmaek and Dukchoon guide him to the afterlife. They explain that they will defend him in seven trials with seven gods in seven hells along forty-nine days to disclose how he spent his life. Ja-hong, who is considered a model citizen, will reincarnate if his guardians are well-succeeded in their defense. However, there are disturbances in the afterlife caused by a Revengeful Spirit and Kangrim goes to the World of the Living to investigate what is happening. Meanwhile the prosecutors find problems in the relationship of Ja-hong and his mother and brother and Haewonmaek and Dukchoon are surprised by the discoveries. Will Ja-hong's soul be saved?"
},{
  "id": "3",
  "title": "Attack 2",
  "type": " Movies",
  "year": 2020,
  "mark": "PG",
  "url": "images/Attack2.jpg",
  "isBookmarked": false,
  "desc": "In 2010 Arjun Shergill is on a mission to capture a terrorist Rehman Gul where he saves a young suicide bomber but captures Rehman Gul.12 years later while traveling in a flight Arjun meets an air hostess Ayesha and falls in love with her both are about to take their relationship further but a terrorist attack at the airport kills Ayesha leaving Arjun badly injured.Arjun is then left bound to wheel chair with only movement in his neck through news channels he finds that the attacker is Hamid Gul son of Rehman Gul whom he had saved 12 years back.The Indian intelligence chief Subramanium comes with the idea to introduce super soldiers operated by robotic means in Indian Army to save loss of lives during cause of war which are designed by Dr. Sabaha Qureshi.Subramanium chooses Arjun for this mission but while getting introduced to this process his chances of survival are minimal.Arjun manages survive the process and turns a super solider who operates with command of IRA designed by Sabaha."  
},{
  "id": "4",
  "title": "Bridgeton",
  "type": "Tv series",
  "year": 2022,
  "mark": "PG",
  "url": "images/Bridgeton.jpg",
  "isBookmarked": false,
  "desc": "From Shondaland and Creator Chris Van Dusen, the first season of Bridgerton follows Daphne Bridgerton (Pheobe Dynevor), the eldest daughter of the powerful Bridgerton family as she makes her debut onto Regency London's competitive marriage market. Hoping to follow in her parent's footsteps and find a match sparked by true love, Daphne's prospects initially seem to be unrivaled. But as her older brother (Jonathan Bailey) begins to rule out her potential suitors, the high society scandal sheet written by the mysterious Lady Whistledown (Julie Andrews) casts aspersions on Daphne. Enter the highly desirable and rebellious Duke of Hastings (Regé-Jean Page), committed bachelor and the catch of the season for the debutantes' mamas. Despite proclaiming that they want nothing the other has to offer, their attraction is undeniable and sparks fly as they find themselves engaged in an increasing battle of wits while navigating society's expectations for their future."  
},{
  "id": "5",
  "title": "Cellar",
  "type": "Movies",
  "year": 2019,
  "mark": "E",
  "url": "images/Cellar.jpg",
  "isBookmarked": true,
  "desc": "Unable to turn down a once-in-a-lifetime opportunity to buy their dream house for nothing, Keira and Brian Woods move into a vast, lavish, fully-furnished Irish manor in the city's suburbs. As their sulky teenage daughter Ellie and her younger brother Steven wander around the cold rooms of their eerily-vacant new home, an intriguing wind-up gramophone in the living room suddenly catches their attention. And, without a doubt, there must be more treasures hidden in plain sight. But who knows what lies behind the kids' peculiar behaviour? What dark, hair-raising wonders lurk in the cellar?" 
},{
  "id": "6",
  "title": "Cyber Hell",
  "type": "Tv series",
  "year": 2020,
  "mark": "PG",
  "url": "images/Cyberhell.jpg",
  "isBookmarked": true,
  "desc": "Cyber Hell: Exposing an Internet Horror is a rattling and quite eye-opening true-crime documentary movie that premiered on the 18th of May, 2022, exclusively on Netflix.Directed by Choi Jin-sung, the documentary delves deep into the dark world of the internet, exploring the spine-chilling case of the Nth Room. Reportedly, the Nth Room was an online s*xual abuse and blackmail circle that blackmailed girls and women into sharing extremely s*xually explicit video content in South Korea."  
},{
  "id": "7",
  "title": "Death On The Nile",
  "type": "Movies",
  "year": 2022,
  "mark": "E",
  "url": "images/Daeathonnile.jpg",
  "isBookmarked": true,
  "desc": "Death on the Nile is a 2022 mystery film directed by Kenneth Branagh from a screenplay by Michael Green, based on the 1937 novel of the same name by Agatha Christie. It was produced by Branagh, Ridley Scott, Judy Hofflund, and Kevin J. Walsh. The film is a sequel to Murder on the Orient Express (2017), and stars Tom Bateman, Annette Bening, Branagh, Russell Brand, Ali Fazal, Dawn French, Gal Gadot, Armie Hammer, Rose Leslie, Emma Mackey, Sophie Okonedo, Jennifer Saunders, and Letitia Wright. Branagh and Bateman return from the first film, reprising their roles as Hercule Poirot and Bouc, respectively. The film is the third screen adaptation of Christie's novel, following the 1978 film and an episode of the television series Agatha Christie's Poirot broadcast in 2004. Principal photography began in September 2019, with filming taking place at Longcross Studios in England, completing that December"  
},{
  "id": "8",
  "title": "Daluchi",
  "type": "Tv series",
  "year": 2009,
  "mark": "PG",
  "url": "images/Daluchi.jpg",
  "isBookmarked": true,
  "desc": "Filesize: 262.53 MB, Duration: 01:15:57, STARS:Mercy Johnson, Odunlade Adekola, Femi Jacobs, Tana Adelana, Tina Mba, Eniola Badmus, Adeniyi Johnson, Olu Salako, Emem Ufot, Lydia Lawrence,A story of a young girl struggling through life until fate finds her and a shocking revelation about her family is revealed."  
},{
  "id": "9",
  "title": "Dare Devil",
  "type": "Tv series",
  "year": 2019,
  "mark": "E",
  "url": "images/Daredevil.jpg",
  "isBookmarked": false,
  "desc": "Marvel's Daredevil is an American television series created by Drew Goddard for the streaming service Netflix, based on the Marvel Comics character Daredevil. It is set in the Marvel Cinematic Universe (MCU), acknowledging the continuity of the franchise's films, and was the first Marvel Netflix series leading to the crossover miniseries The Defenders. Daredevil was produced by Marvel Television in association with ABC Studios. Steven S. DeKnight served as showrunner for the first season, with Doug Petrie and Marco Ramirez taking over as co-showrunners for the second, and Erik Oleson joining the series as showrunner for the third; Goddard served as a consultant for the series"  
},{
  "id": "10",
  "title": "Dropout",
  "type": "Movies",
  "year": 2020,
  "mark": "E",
  "url": "images/Dropout.jpg",
  "isBookmarked": true,
  "desc": "The Dropout is an American drama streaming television miniseries created by Elizabeth Meriwether, based on the podcast The Dropout hosted by Rebecca Jarvis and produced by ABC News. It documents the disgraced biotechnology company Theranos and its founder Elizabeth Holmes (played by Amanda Seyfried).[1] The series premiered on the streaming service Hulu on March 3, 2022."  
},{
  "id": "11",
  "title": "Dr Strange",
  "type": "Movies",
  "year": 2021,
  "mark": "PG",
  "url": "images/Drstrange.jpg",
  "isBookmarked": true,
  "desc": "Dr. Stephen Strange's (Benedict Cumberbatch) life changes after a car accident robs him of the use of his hands. When traditional medicine fails him, he looks for healing, and hope, in a mysterious enclave. He quickly learns that the enclave is at the front line of a battle against unseen dark forces bent on destroying reality. Before long, Strange is forced to choose between his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence."  
},{
  "id": "12",
  "title": "Dumbledore",
  "type": "Tv series",
  "year": 2022,
  "mark": "18+",
  "url": "images/Dumbledore.jpg",
  "isBookmarked": false,
  "desc": "Fantastic Beasts: The Secrets of Dumbledore is a 2022 fantasy film directed by David Yates from a screenplay by J. K. Rowling and Steve Kloves. The sequel to Fantastic Beasts and Where to Find Them (2016) and Fantastic Beasts: The Crimes of Grindelwald (2018), it is the third instalment in the Fantastic Beasts film series and the eleventh overall in the Wizarding World franchise. Its cast includes Eddie Redmayne, Jude Law, Ezra Miller, Dan Fogler, Alison Sudol, Callum Turner, Jessica Williams, Katherine Waterston, and Mads Mikkelsen. Set several years after the events of its predecessor, the film sees Albus Dumbledore tasking Newt Scamander and his allies with a mission that takes them into the heart of dark wizard Gellert Grindelwald's army."  
},{
  "id": "13",
  "title": "Dune",
  "type": "Movies",
  "year": 2020,
  "mark": "PG",
  "url": "images/Dune.jpg",
  "isBookmarked": true,
  "desc": "A mythic and emotionally charged hero's journey, Dune tells the story of Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, who must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive."  
},{
  "id": "14",
  "title": "Ekun Iyawo",
  "type": "Tv series",
  "year": 2020,
  "mark": "E",
  "url": "images/Ekuniyawo.jpg",
  "isBookmarked": false,
  "desc": "Tagged a rebel, disliked by many but his heart is always in the right place. Cast: Antar Laniyan, Jide Kosoko, Ayo Mogaji, Adeniyi Johnson, Efe Irele"  
},{
  "id": "15",
  "title": "Equalizer",
  "type": "Tv series",
  "year": 2021,
  "mark": "18+",
  "url": "images/Equalizer.jpg",
  "isBookmarked": true,
  "desc": "Robert McCall (Denzel Washington), a man of mysterious origin who believes he has put the past behind him, dedicates himself to creating a quiet new life. However, when he meets Teri (Chloë Grace Moretz), a teenager who has been manhandled by violent Russian mobsters, he simply cannot walk away. With his set of formidable skills, McCall comes out of self-imposed retirement and emerges as an avenging angel, ready to take down anyone who brutalizes the helpless."  
},{
  "id": "17",
  "title": "Snowfall",
  "type": "Movies",
  "year": 2022,
  "mark": "PG",
  "url": "images/Fall.jpg",
  "isBookmarked": true,
  "desc": "Snowfall is an American crime drama television series, created by John Singleton, Eric Amadio, and Dave Andron, that was first broadcast on FX on July 5, 2017.[1] Set in Los Angeles in 1983, the series revolves around the first crack epidemic and its impact on the city. The series follows the stories of several characters whose lives are fated to intersect: 20-year-old drug dealer Franklin Saint, Mexican luchador Gustavo El Oso Zapata, CIA operative Teddy McDonald, and a Mexican crime boss's niece, Lucia Villanueva"  
},{
  "id": "18",
  "title": "First Kill",
  "type": "Tv series",
  "year": 2022,
  "mark": "PG",
  "url": "images/Firstkill.jpg",
  "isBookmarked": true,
  "desc": "First Kill follows two high school girls who are in love but have a big problem standing in the way of their romance: They’re supposed to destroy each other. Calliope Burns, a monster hunter played by Imani Lewis, wants to prove herself to her family by making her first kill. At the same time, Juliette Fairmont, a vampire played by Sarah Catherine Hook, needs to drain a human’s blood in order to enter adulthood. When the two girls kiss for the first time inside a pantry during a house party, their commitment to their duties starts to crumble."  
},{
  "id": "19",
  "title": "Harry Porter",
  "type": "Tv series",
  "year": 2020,
  "mark": "PG",
  "url": "images/Harry.jpg",
  "isBookmarked": false,
  "desc": "Harry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's struggle against Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic and subjugate all wizards and Muggles (non-magical people)."  
},{
  "id": "20",
  "title": "Sonic 2",
  "type": "Movies",
  "year": 2022,
  "mark": "PG",
  "url": "images/Sonic 2.jpg",
  "isBookmarked": true,
  "desc": "Sonic the Hedgehog 2[b] is a 2022 action-adventure comedy film based on the video game series of the same name published by Sega, and the sequel to Sonic the Hedgehog (2020). Directed by Jeff Fowler and written by Pat Casey, Josh Miller, and John Whittington, it stars Ben Schwartz reprising his role as the voice of Sonic the Hedgehog, alongside James Marsden, Tika Sumpter, Natasha Rothwell, Adam Pally, Shemar Moore, Colleen O'Shaughnessey, Lee Majdoub, Idris Elba and Jim Carrey. The film follows Sonic and Tails, who team up to find the Master Emerald before Dr. Robotnik and Knuckles the Echidna do, while also contending with the military organization G.U.N."  
},{
  "id": "21",
  "title": "Jagunas Heart",
  "type": "Movies",
  "year": 2022,
  "mark": "E",
  "url": "images/Jagunasheart.jpg",
  "isBookmarked": true,
  "desc": "A conspiracy against Abike by an admirer will set her on the path to redeeming herself but a jealous lover stands in the way. Cast: Kenneth Okolie, Femi Durojaiye, Layole Oyatogun, Bernard Bold Ugbunu."  
},{
  "id": "22",
  "title": "The Silent Sea",
  "type": "Movies",
  "year": 2020,
  "mark": "E",
  "url": "images/Silent.jpg",
  "isBookmarked": true,
  "desc": "On a near-future Earth suffering from extreme desertification, draconian measures have been put in place for potable water rationing. Scientist Song Ji‑An (Bae Doona) joins a hand-picked team of elite personnel on a mission to the moon. They are headed to an abandoned research facility, Balhae Station, where her sister died five years prior, after 117 personnel were killed in an incident. The circumstances surrounding the incident are secret. Their mission is to retrieve a mysterious and sensitive sample. The captain of the team, Han Yun‑Jae (Gong Yoo), is a soldier for the space agency. Lieutenant Ryu Tae‑seok (Lee Joon) of the Ministry of National Defense volunteers to be part of the crew."  
}
  
  ],
  "trending":[{
  "id": "23",
  "title": "Chip N Dale",
  "type": "Movies",
  "year": 2022,
  "mark": "PG",
  "url": "images/Chipndale.jpg",
  "isBookmarked": true,
  "desc": "In a world co-populated by humans and cartoon characters, Chip and Dale meet in elementary school and become best friends. They later relocate to Hollywood and, after casting as extras in commercials and shows, go on to star in the successful television series Chip 'n Dale: Rescue Rangers in the early 1990s. When Dale gets his own show, Double-O-Dale, the two have a falling-out, leading to both shows' cancellation.Thirty years later, Chip is a successful but disillusioned insurance salesman while Dale spends most of his time on the fan convention circuit. The two are contacted by their old co-star Monterey Jack, who owes money to the criminal Valley Gang due to his stinky cheese addiction."  
},{
  "id": "24",
  "title": "Ms marvel",
  "type": "Movies",
  "year": 2018,
  "mark": "PG",
  "url": "images/Msmarvel.jpg",
  "isBookmarked": false,
 "desc": "Kamala Khan is a 16-year-old high schooler and fangirl of the Avengers, particularly Captain Marvel. After failing another driving test and meeting with school counselor Gabe Wilson, Kamala and her best friend Bruno Carrelli finish her Captain Marvel cosplay for AvengerCon while avoiding her strict parents, Yusuf and Muneeba. Kamala receives a package of items from her grandmother, including a golden bangle, but Muneeba sees it as junk. After failing to convince her parents to let her go to AvengerCon, Kamala and Carrelli sneak out and attend anyway, taking the bangle as part of her cosplay. After getting there and dressing up, she puts it on, but it causes her to project constructs of cosmic energy, inadvertently causing havoc. Amidst the chaos, Kamala uses her powers to save her classmate Zoe Zimmer from falling."    
},{
  "id": "25",
  "title": "Stranger Things 4",
  "type": "Tv series",
  "year": 2022,
  "mark": "PG",
  "url": "images/Strangerthings4.jpg",
  "isBookmarked": true,
 "desc": "In a flashback to 1979, Dr. Brenner is experimenting on children possessing supernatural abilities until a mysterious incident kills all of the children except Eleven. In 1986—nine months after the events at Starcourt Mall—Joyce, Will, Jonathan, and Eleven have moved to California, where Eleven struggles with the loss of her powers and is routinely bullied by other students. Joyce receives a porcelain doll in the mail, seemingly from Russia, and finds a hidden note stating that Hopper is alive. In Hawkins, Mike and Dustin have joined their high school's Hellfire Club, a Dungeons & Dragons club led by the eccentric Eddie Munson. As a result, they miss seeing Lucas win the basketball team's championship game. Max, who has broken up with Lucas, struggles to grieve Billy's death."    
},{
  "id": "26",
  "title": "Wandavision",
  "type": "Movies",
  "year": 2021,
  "mark": "PG",
  "url": "images/Wandavision.jpg",
  "isBookmarked": true,
 "desc": "Newlywed couple Wanda Maximoff and Vision move into the town of Westview in a black-and-white 1950s setting. They attempt to blend in despite Vision being an android and Maximoff having telekinesis and reality-warping abilities. One day they notice a heart drawn on their calendar, but cannot remember what the occasion is. While Vision goes to his job at Computational Services Inc., Maximoff decides that the heart represents their anniversary. Their neighbor Agnes introduces herself to Maximoff and helps her prepare to celebrate that night. Vision amazes his co-workers with his speed but is unsure what his company actually does."    
},{
  "id": "27",
  "title": "Multiverse Of Madness",
  "type": "Movies",
  "year": 2020,
  "mark": "E",
  "url": "images/Multiverse.jpg",
  "isBookmarked": false,
 "desc": "America Chavez and a version of Stephen Strange are chased by a demon in the space between universes while searching for the Book of Vishanti. That Strange is killed and Chavez accidentally creates a portal that transports herself and Strange's corpse to Earth-616,[N 1] where that universe's version of Strange rescues Chavez from another demon[N 2] with help from the Sorcerer Supreme, Wong. Chavez explains that the beings are hunting her because she has the power to travel through the multiverse."    
},{
  "id": "28",
  "title": "Pandora's Box",
  "type": "Movies",
  "year": 2021,
  "mark": "PG",
  "url": "images/Pandorabox.jpg",
  "isBookmarked": false,
 "desc": "Movie 🎥 Upload, Genre: Romance/Drama, After suffering a memory loss, a young man is entangled in a spiral of love affairs between his caretaker and a medical doctor who happens to have a connection with his tragic past."    
},{
  "id": "29",
  "title": "Moon Knight",
  "type": "Tv series",
  "year": 2022,
  "mark": "PG",
  "url": "images/Moon knight.jpg",
  "isBookmarked": true,
 "desc": "The son of a rabbi, Marc Spector served as a Force Recon Marine and briefly as a CIA operative before becoming a mercenary alongside his friend Jean-Paul Frenchie DuChamp. During a job in Sudan, Spector is appalled when ruthless fellow mercenary Raoul Bushman attacks and kills archeologist Dr. Alraune in front of the man's daughter and colleague, Marlene Alraune. After fighting Bushman and being left for dead, a mortally wounded Spector reaches Alraune's recently unearthed tomb and is placed before a statue of the Egyptian moon god Khonshu."    
}
]
}